Documents/ESB/ESB_Consumer_0616/003TestSample/SAMPLE_XML_MUST/Payment/PA02_CardFundXferAddRq.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://www.iisigroup.com/magiclamp/common/soapenv.xsd/v1" xmlns:v11="http://www.nextbank.com.tw/xsd/TW/Payment/CardFundXferAddRq/v1">  
  <soap:Header> 
    <v1:Header v1:mustUnderstand="true"> 
      <ChannelID>ESB</ChannelID>  
      <ServiceDomain>Payment</ServiceDomain>  
      <OperationName>CardFundXferAdd</OperationName>  
      <ConsumerID>TWESB</ConsumerID>  
      <TransactionID>T1222222</TransactionID>  
      <RqTimestamp>2015-12-06T12:01:01.00+08:00</RqTimestamp> 
    </v1:Header> 
  </soap:Header>  
  <soap:Body> 
    <v11:CardFundXferAddRq> 
      <v11:ServiceHeader> 
        <v11:TxnId>PA02</v11:TxnId>  
        <v11:TxnNo>PA0200001</v11:TxnNo> 
      </v11:ServiceHeader>  
      <v11:Signon> 
        <v11:CustId>ESBUSER</v11:CustId> 
      </v11:Signon>  
      <v11:ServiceBody> 
        <!--Optional:-->  
        <v11:ValidateOnly>false</v11:ValidateOnly>  
        <v11:TxnType>1</v11:TxnType>  
        <!--Optional:-->  
        <v11:Id>AAACT193372H91D4ZL</v11:Id>  
        <!--Optional:-->  
        <v11:LockInfo> 
          <v11:LockSeqNo>ACLK2002557245</v11:LockSeqNo>  
          <v11:FundXferType>AC</v11:FundXferType>  
          <v11:AcctNo>84980000000026</v11:AcctNo>  
          <!--Optional:-->  
          <v11:AmtCcy>TWD</v11:AmtCcy>  
          <v11:TxnAmt>5000</v11:TxnAmt>  
          <!--Optional:-->  
          <v11:APIKey>NCB-IF17003</v11:APIKey> 
        </v11:LockInfo> 
      </v11:ServiceBody> 
    </v11:CardFundXferAddRq> 
  </soap:Body> 
</soap:Envelope>
